{
    "Descriptions": [
        {
            "name": "alpine sea holly",
            "family": "Apiaceae",
            "genus": "Eryngium",
            "species": "E. alpinum",
            "wiki": "Eryngium alpinum is a hemicryptophyte, its overwintering buds are situated just below the soil surface and the floral axis more or less erect with a few leaves. The roots are deep and robust. The stems are solitary and erect, usually with three branches on the apex and with longitudinal purple stripes. This plant generally reaches about 30–70 centimetres (12–28 in) in height, with a maximum of 100 centimetres (39 in). The basal leaves are oval or heart-shaped, 10–15 centimetres (3.9–5.9 in) wide and 13–17 centimetres (5.1–6.7 in) long, with toothed hedges and a long petiole. The cauline leaves are sessile and progressively more divided.The inflorescences are dense umbels at the top of the main branches. They are bright green at the bases and the stiff, bristly bracts are blue. They are about 4 cm long and 2 cm diameter and the bracts are up to 25 centimetres (9.8 in) long.[1] The flowers inside are about 2 mm long. The peripheral flowers are sterile and the internal flowers are hermaphroditic. Both types are actinomorphic and pentamerous, with five petals. Flowering occurs in July through September. The flowers are insect-pollinated. The fruit is a spiny achene about half a centimeter wide."
        },
        {
            "name": "anthurium",
            "family": "Araceae",
            "genus": "Anthurium",
            "species": "",
            "wiki": "Anthurium, is a genus of about 1000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, and laceleaf. The genus is native to the Americas, where it is distributed from northern Mexico to northern Argentina and parts of the Caribbean. Like most houseplants, Anthurium has been shown to help remove formaldehyde, xylene, and ammonia from household air. It was one of the plants cited as such in the NASA Clean Air Study."
        },
        {
            "name": "artichoke flower",
            "family": "Asteraceae",
            "genus": "Cynara",
            "species": "C. cardunculus",
            "wiki": "The globe artichoke (Cynara cardunculus var. scolymus) is a variety of a species of thistle cultivated as a food. The edible portion of the plant consists of the flower buds before the flowers come into bloom. The budding artichoke flower-head is a cluster of many budding small flowers (an inflorescence), together with many bracts, on an edible base. Once the buds bloom, the structure changes to a coarse, barely edible form. Another variety of the same species is the cardoon, a perennial plant native to the Mediterranean region. Both wild forms and cultivated varieties (cultivars) exist."
        },
        {
            "name": "azalea",
            "family": "Ericaceae",
            "genus": "Rhododendron",
            "species": "R. tsutsusi, R. pentanthera",
            "wiki": "Azaleas are flowering shrubs in the genus Rhododendron, particularly the former sections Tsutsuji (evergreen) and Pentanthera (deciduous). Azaleas bloom in spring, their flowers often lasting several weeks. Shade tolerant, they prefer living near or under trees. They are part of the family Ericaceae."
        },
        {
            "name": "balloon flower",
            "family": "Campanulaceae",
            "genus": "Platycodon",
            "species": "P. grandiflorus",
            "wiki": "Platycodon grandiflorus (from Ancient Greek πλατύς \"wide\" and κώδων \"bell\") is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia (China, Korea, Japan, and the Russian Far East). It is commonly known as balloon flower (referring to the balloon-shaped flower buds), Chinese bellflower, or platycodon."
        },
        {
            "name": "barbeton daisy",
            "family": "Asteraceae",
            "genus": "Gerbera",
            "species": "G. jamesonii",
            "wiki": "Gerbera jamesonii is a species of flowering plant in the genus Gerbera. It is indigenous to South Eastern Africa and commonly known as the Barberton daisy, the Transvaal daisy, and as Barbertonse madeliefie in Afrikaans. The species is perennial and reproduces asexually. This plant produces tall colorful flowers in season. The flowers may be red, yellow, pink, or orange."
        },
        {
            "name": "bearded iris",
            "family": "Iridaceae",
            "genus": "Iris",
            "species": "I. × germanica",
            "wiki": "Iris × germanica is the accepted name for a species of flowering plants in the family Iridaceae commonly known as the bearded iris or the German bearded iris. It is one of a group of hybrid origin. Iris × germanica grows up to 120 cm high and 30 cm wide. It is a European hybrid, rather than a true wild species. The roots can go up to 10 cm deep and it is a rhizomatous perennial that blooms mid to late spring. It is known to produce the isoflavone irilone. Hundreds of hybrids exist representing nearly every colour from jet black to sparkling whites, except bright scarlet. Varieties include I. × g. var. florentina and I. × g. var. germanica."
        },
        {
            "name": "bee balm",
            "family": "Lamiaceae",
            "genus": "Monarda",
            "species": "M. fistulosa",
            "wiki": "Monarda is a genus of flowering plants in the mint family, Lamiaceae. The genus is endemic to North America. Common names include bee balm, horsemint, oswego tea, and bergamot, the latter inspired by the fragrance of the leaves, which is reminiscent of bergamot orange (Citrus bergamia). The genus was named for the Spanish botanist Nicolás Monardes, who wrote a book in 1574 describing plants of the New World. Monarda species include annual and perennial herbaceous plants. They grow erect to heights of 20–90 cm (8–35 in). The slender, serrated, lanceolate leaves are oppositely arranged on the stem, hairless or sparsely hairy, and about 7 to 14 centimeters long."
        },
        {
            "name": "bird of paradise",
            "family": "Strelitziaceae",
            "genus": "Strelitzia",
            "species": "S. nicolai, S. caudata",
            "wiki": "Strelitzia is a genus of five species of perennial plants, native to South Africa. It belongs to the plant family Strelitziaceae. The genus is named after the duchy of Mecklenburg-Strelitz, birthplace of Queen Charlotte of the United Kingdom. A common name of the genus is bird of paradise flower / plant, because of a resemblance of its flowers to birds-of-paradise. In South Africa it is commonly known as a crane flower and is featured on the reverse of the 50 cent coin. It is the floral emblem of the City of Los Angeles; two of the species, Strelitzia nicolai and Strelitzia reginae, are frequently grown as house plants. The species S. nicolai is the largest in the genus, reaching 10 m tall, with stately white and blue flowers; the other species typically reach 2 to 3.5 m tall, except S. caudata which is a tree of a typically smaller size than S. nicolai. The leaves are large, 30–200 cm long and 10–80 cm broad, similar to a banana leaf in appearance but with a longer petiole, and arranged strictly in two ranks to form a fan-like crown of evergreen foliage. The flowers are produced in a horizontal inflorescence emerging from a stout spathe."
        },
        {
            "name": "bishop of llandaff",
            "family": "Asteraceae",
            "genus": "Dahlia",
            "species": "Dahlia × hortensis",
            "wiki": "Dahlia 'Bishop of Llandaff' is a branching, tuberous tender perennial cultivar with dark eggplant-colored, almost black, foliage. This produces a stunning contrast with its scarlet flowers. The plant was first bred by Fred Treseder, a Cardiff nurseryman. It was selected by and named to honour Joshua Pritchard Hughes, Bishop of Llandaff, in 1924 and won the RHS Award of Garden Merit in 1928. The plant is about 1 m tall and flowers from June until September. As with all dahlias, frost blackens its foliage, and its tubers need to be overwintered in a dry, frost-free place. A seed strain has been produced from this plant called 'Bishops Children', they retain the dark foliage color but produce a mix of flower colors and flower shapes from single to semi-double flowers in different sizes. Plant Profile:- Height:1.1m (3&1/2 ft) Spread: 45 cm (18 in) site: Full Sun Soil: Fertile, free-draining Hardiness: Half hardy. Also comes in rich reds & purples, yellows & oranges, as well as paler shades."
        },
        {
            "name": "black-eyed susan",
            "family": "Asteraceae",
            "genus": "Rudbeckia",
            "species": "R. hirta",
            "wiki": "Rudbeckia hirta, commonly called black-eyed Susan, is a North American flowering plant in the sunflower family, native to Eastern and Central North America and naturalized in the Western part of the continent as well as in China. It has now been found in all 10 Canadian Provinces and all 48 of the states in the contiguous United States. Rudbeckia hirta is one of a number of plants with the common name black-eyed Susan. Other common names for this plant include: brown-eyed Susan, brown betty, gloriosa daisy, golden Jerusalem, English bull's eye, poor-land daisy, yellow daisy, and yellow ox-eye daisy. Rudbeckia hirta is the state flower of Maryland. The plant also is a traditional Native American medicinal herb in several tribal nations; believed in those cultures to be a remedy, among other things, for colds, flu, infection, swelling and (topically, by poultice) for snake bite (although not all parts of the plant are edible). Parts of the plant have nutritional value. Other parts are not edible."
        },
        {
            "name": "blackberry lily",
            "family": "Iridaceae",
            "genus": "Iris",
            "species": "I. domestica",
            "wiki": "Iris domestica, commonly known as leopard lily, blackberry lily, and leopard flower, is an ornamental plant in the Iridaceae family. The plant grows 60–90 cm tall in full sun and is often found blanketing hillsides; the flowers can range from red to orange to yellow, or mixed, and bloom in summer to early autumn (fall). The leaves grow in a fan, like those of a gladiolus. The flowers are typically orange spotted with red, although yellow-flowered varieties are in cultivation. The seed pods open in the fall, showing clusters of black seeds whose fancied resemblance to a blackberry gives the plant its common name, \"blackberry lily\". The leopard lily is a flowering perennial of Chinese origin, and is locally used in Chinese villages for its medicinal values."
        },
        {
            "name": "blanket flower",
            "family": "Asteraceae",
            "genus": "Gaillardia",
            "species": "",
            "wiki": "Gaillardia (common name blanket flower) is a genus of flowering plants in the sunflower family, Asteraceae, native to North and South America. It was named after an M. Gaillard de Charentonneau, an 18th-century French magistrate who was a patron of botany. The common name may refer to the resemblance of the inflorescence to the brightly patterned blankets made by Native Americans, or to the ability of wild taxa to blanket the ground with colonies. Many cultivars have been bred for ornamental use. These are annual or perennial herbs or subshrubs, sometimes with rhizomes. The stem is usually branching and erect to a maximum height around 80 centimeters (31.5 inches)."
        },
        {
            "name": "bolero deep blue",
            "family": "Gentianaceae",
            "genus": "Eustoma",
            "species": "E. russellianum",
            "wiki": "Eustoma russellianum, is a species of flowering plant in the gentian family. Its previous binomial name was Eustoma grandiflorum. Common names include Bolero Deep Blue, Texas bluebells, Texas bluebell, bluebell, showy prairie gentian, prairie gentian, and Lisianthus. Eustoma russellianum has blue-green waxy leaves and showy bell shaped flowers in blue pink or white each borne singly on an upright plant. Depending on where it grows it may present as an annual, biennial or perennial plant. It is found in the Great Plains region."
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
            "family": "",
            "genus": "",
            "species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        },
        {
            "name": "",
"family": "",
"genus": "",
"species": "",
            "wiki": "photo"
        }
      ]
}
